#### `terraform plan` Success
<details><summary>Show Output</summary>

```

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.admin_admin[0] will be created
  + resource "aws_iam_group_policy_attachment" "admin_admin" {
      + group      = "tf-aws-cost-slack-production-admin"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.admin_cd_lambdas[0] will be created
  + resource "aws_iam_group_policy_attachment" "admin_cd_lambdas" {
      + group      = "tf-aws-cost-slack-production-admin"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.admin_developer[0] will be created
  + resource "aws_iam_group_policy_attachment" "admin_developer" {
      + group      = "tf-aws-cost-slack-production-admin"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.ci_developer[0] will be created
  + resource "aws_iam_group_policy_attachment" "ci_developer" {
      + group      = "tf-aws-cost-slack-production-ci"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_group_policy_attachment.developer_developer[0] will be created
  + resource "aws_iam_group_policy_attachment" "developer_developer" {
      + group      = "tf-aws-cost-slack-production-developer"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.admin must be replaced
-/+ resource "aws_iam_policy" "admin" {
      ~ arn    = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-admin" -> (known after apply)
      ~ id     = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-admin" -> (known after apply)
      ~ name   = "tf-aws-cost-slack-development-admin" -> "tf-aws-cost-slack-production-admin" # forces replacement
        path   = "/"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "cloudformation:PreviewStackUpdate",
                            "cloudformation:ListStacks",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "cloudformation:DeleteStack",
                            "cloudformation:CreateUploadBucket",
                            "cloudformation:CreateStack",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:cloudformation:*:589845989135:stack/sls-aws-cost-slack-development/*" -> "arn:*:cloudformation:*:589845989135:stack/sls-aws-cost-slack-production/*"
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "s3:PutEncryptionConfiguration",
                            "s3:PutBucketPolicy",
                            "s3:GetEncryptionConfiguration",
                            "s3:DeleteBucketPolicy",
                            "s3:DeleteBucket",
                            "s3:CreateBucket",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:*:s3:::sls-aws-cost-slack-*-serverless*-*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "iam:DetachRolePolicy",
                            "iam:DeleteRolePolicy",
                            "iam:DeleteRole",
                            "iam:CreateRole",
                            "iam:AttachRolePolicy",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution" -> "arn:*:iam::589845989135:role/tf-aws-cost-slack-production-lambda-execution"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "events:Remove*",
                            "events:Put*",
                            "events:Delete*",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:events:*:589845989135:rule/sls-aws-cost-slack-development" -> "arn:*:events:*:589845989135:rule/sls-aws-cost-slack-production"
                        Sid      = ""
                    },
                    {
                        Action   = "cloudwatch:GetMetricStatistics"
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.cd_lambdas must be replaced
-/+ resource "aws_iam_policy" "cd_lambdas" {
      ~ arn    = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-cd-lambdas" -> (known after apply)
      ~ id     = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-cd-lambdas" -> (known after apply)
      ~ name   = "tf-aws-cost-slack-development-cd-lambdas" -> "tf-aws-cost-slack-production-cd-lambdas" # forces replacement
        path   = "/"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = [
                            "lambda:UntagResource",
                            "lambda:TagResource",
                            "lambda:ListTags",
                            "lambda:ListFunctions",
                            "lambda:ListEventSourceMappings",
                            "lambda:GetEventSourceMapping",
                        ]
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "lambda:DeleteFunction",
                            "lambda:CreateFunction",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:lambda:*:589845989135:function:sls-aws-cost-slack-development-*" -> "arn:*:lambda:*:589845989135:function:sls-aws-cost-slack-production-*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "iam:PutRolePolicy",
                            "iam:DeleteRolePolicy",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution" -> "arn:*:iam::589845989135:role/tf-aws-cost-slack-production-lambda-execution"
                        Sid      = ""
                    },
                    {
                        Action   = "logs:DescribeLogGroups"
                        Effect   = "Allow"
                        Resource = "arn:*:logs:*:589845989135:log-group::log-stream:"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "logs:PutLogEvents",
                            "logs:DeleteLogGroup",
                            "logs:CreateLogStream",
                            "logs:CreateLogGroup",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development-*:log-stream:" -> "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-production-*:log-stream:"
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_policy.developer must be replaced
-/+ resource "aws_iam_policy" "developer" {
      ~ arn    = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-developer" -> (known after apply)
      ~ id     = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-development-developer" -> (known after apply)
      ~ name   = "tf-aws-cost-slack-development-developer" -> "tf-aws-cost-slack-production-developer" # forces replacement
        path   = "/"
      ~ policy = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action   = "cloudformation:ValidateTemplate"
                        Effect   = "Allow"
                        Resource = "*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "cloudformation:UpdateStack",
                            "cloudformation:ListStackResources",
                            "cloudformation:ListChangeSets",
                            "cloudformation:Get*",
                            "cloudformation:DescribeStacks",
                            "cloudformation:DescribeStackResources",
                            "cloudformation:DescribeStackResource",
                            "cloudformation:DescribeStackEvents",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:cloudformation:*:589845989135:stack/sls-aws-cost-slack-development/*" -> "arn:*:cloudformation:*:589845989135:stack/sls-aws-cost-slack-production/*"
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "s3:PutObject",
                            "s3:ListBucketVersions",
                            "s3:ListBucket",
                            "s3:GetObject",
                            "s3:DeleteObject",
                        ]
                        Effect   = "Allow"
                        Resource = "arn:*:s3:::sls-aws-cost-slack-*-serverless*-*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "iam:PassRole",
                            "iam:GetRole",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:iam::589845989135:role/tf-aws-cost-slack-development-lambda-execution" -> "arn:*:iam::589845989135:role/tf-aws-cost-slack-production-lambda-execution"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "lambda:Update*",
                            "lambda:RemovePermission",
                            "lambda:PublishVersion",
                            "lambda:ListVersionsByFunction",
                            "lambda:ListAliases",
                            "lambda:InvokeFunction",
                            "lambda:GetPolicy",
                            "lambda:GetFunctionConfiguration",
                            "lambda:GetFunction",
                            "lambda:GetAlias",
                            "lambda:CreateAlias",
                            "lambda:AddPermission",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:lambda:*:589845989135:function:sls-aws-cost-slack-development-*" -> "arn:*:lambda:*:589845989135:function:sls-aws-cost-slack-production-*"
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "lambda:PublishLayerVersion",
                            "lambda:GetLayerVersion",
                            "lambda:DeleteLayerVersion",
                        ]
                        Effect   = "Allow"
                      ~ Resource = "arn:*:lambda:*:589845989135:layer:sls-aws-cost-slack-development-*" -> "arn:*:lambda:*:589845989135:layer:sls-aws-cost-slack-production-*"
                        Sid      = ""
                    },
                    {
                        Action   = [
                            "apigateway:UpdateRestApiPolicy",
                            "apigateway:PUT",
                            "apigateway:POST",
                            "apigateway:PATCH",
                            "apigateway:GET",
                            "apigateway:DELETE",
                        ]
                        Effect   = "Allow"
                        Resource = [
                            "arn:*:apigateway:*::/tags*",
                            "arn:*:apigateway:*::/restapis*",
                        ]
                        Sid      = ""
                    },
                  ~ {
                        Action   = [
                            "logs:GetLogEvents",
                            "logs:FilterLogEvents",
                            "logs:DescribeLogStreams",
                            "logs:DescribeLogGroups",
                        ]
                        Effect   = "Allow"
                      ~ Resource = [
                          - "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development-*:log-stream:*",
                          - "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-development-*:log-stream:",
                          + "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-production-*:log-stream:*",
                          + "arn:*:logs:*:589845989135:log-group:/aws/lambda/sls-aws-cost-slack-production-*:log-stream:",
                        ]
                        Sid      = ""
                    },
                ]
                Version   = "2012-10-17"
            }
        )
    }

  # module.aws-cost-slack.module.serverless.aws_iam_role_policy_attachment.lambda will be created
  + resource "aws_iam_role_policy_attachment" "lambda" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::589845989135:policy/tf-aws-cost-slack-production-lambda-execution"
      + role       = "tf-aws-cost-slack-production-lambda-execution"
    }

Plan: 9 to add, 0 to change, 3 to destroy.
```

</details>

*Workflow: `Terraform Pull Request`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`*
